{
  "backend/main.mo": "Actor storing per-user food logs with functions to add entries, retrieve sorted entries, and compute nutrient totals.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend source files involved in meal and nutrition tracking.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light and dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point that loads fonts, icons, and mounts the React application.",
  "frontend/README.md": "Project overview and setup guide for the Daily Meal Nutrition Calculator frontend.",
  "frontend/src/App.tsx": "Root component wrapping the app in ThemeProvider and rendering the main calculator page and toaster.",
  "frontend/src/components/all-meals/AllMealsTodaySection.tsx": "Displays saved meals with expandable sections and scaled nutrient values per food item.",
  "frontend/src/components/current-meal/CurrentMealSection.tsx": "Main meal builder UI that parses food input, fetches nutrition data, manages food list edits, and displays meal totals with save controls.",
  "frontend/src/components/current-meal/FoodRowEditor.tsx": "Editable row for a food item allowing amount/unit changes and showing scaled nutrition with optional conversion notes.",
  "frontend/src/components/current-meal/SaveMealControls.tsx": "Provides a dialog and controls to save the current meal under a category or custom name, then clears the builder.",
  "frontend/src/components/daily-summary/DailySummaryDashboard.tsx": "Displays daily nutrition totals, progress toward goals, hints, and options to edit goals or clear the day's data.",
  "frontend/src/components/daily-summary/EditGoalsDialog.tsx": "Dialog for modifying daily calorie and protein goals with validation before saving.",
  "frontend/src/components/Header.tsx": "Header component with logo, title, settings button, and API key warning banner.",
  "frontend/src/components/nutrition/NutritionTable.tsx": "Renders a table or compact grid showing rounded macronutrient values for calories, protein, carbs, fat, fiber, and sugar.",
  "frontend/src/components/nutrition/VitaminsMineralsPanel.tsx": "Accordion panel listing vitamin and mineral values in an expandable layout.",
  "frontend/src/components/settings/ApiKeySettingsDialog.tsx": "React dialog for entering, loading, and saving the USDA API key in localStorage.",
  "frontend/src/components/Toaster.tsx": "Theme-aware wrapper around the Sonner toast notification system.",
  "frontend/src/domain/models.ts": "Defines core TypeScript models for nutrients, food items, meals, parsed inputs, and daily state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and logout state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module reserved for future backend React Query hooks.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables and base styling for light and dark themes.",
  "frontend/src/main.tsx": "App entry rendering React root with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/DailyMealNutritionCalculator.tsx": "Main page composing current meal builder, meals list, and daily summary sections.",
  "frontend/src/services/nutritionApiClient.ts": "USDA API client for searching foods and mapping results to FoodItem objects with detailed error handling.",
  "frontend/src/state/storage.ts": "LocalStorage persistence utilities for API keys, day state, and daily goals with safe access and versioning.",
  "frontend/src/state/useCurrentMeal.ts": "Hook managing the current meal’s food list with add, update, remove, and computed total nutrients.",
  "frontend/src/state/useDailyGoals.ts": "React hook that loads, updates, and persists custom daily nutrition goals and merges them with defaults.",
  "frontend/src/state/useDayMeals.ts": "Manages today's meals with localStorage persistence and computes daily nutrient totals.",
  "frontend/src/utils/aggregations.ts": "Provides pure functions to aggregate nutrient totals for meals and full days, including vitamin merging.",
  "frontend/src/utils/foodParser.ts": "Parses free‑text food input to extract item names, quantities, and units using simple pattern rules.",
  "frontend/src/utils/nutrientMapping.ts": "Maps USDA nutrient data fields into the app’s normalized Nutrients model, including vitamins and minerals.",
  "frontend/src/utils/recommendations.ts": "Calculates progress toward goals and generates simple health hints based on daily nutrient totals.",
  "frontend/src/utils/servingMath.ts": "Computes serving multipliers and scales nutrients based on user quantities and baseline serving metadata.",
  "frontend/tailwind.config.js": "Project Tailwind CSS configuration with custom colors, typography, animations, and container settings.",
  "project_state.json": "Tracks project metadata, features, requirements, and known issues for the nutrition calculator app."
}